[
    {
        "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-fed-takes-front-seat-from-mideast-fears-231755274.html",
        "title": "Stock market today: Dow, S&P 500, Nasdaq waver as Fed holds rates steady, forecasts 2 cuts in 2025",
        "content": "US stocks edged higher on Wednesday, with the prospect of the US joining Israel-Iran hostilities keeping investors on edge as the Federal Reserve held interest rates steady.\n\nThe central bank also released its latest Summary of Economic Projections (SEP), including its \"dot plot,\" which maps out policymakers' expectations for where interest rates could be headed in the future. The median official's forecast for the federal funds rate at the end of 2025 was 3.9%, which would likely represent two 25-basis-point cuts this year.\n\nThe Dow Jones Industrial Average (^DJI) rose less than 0.1%, while the S&P 500 (^GSPC) was up 0.2%. The Nasdaq Composite (^IXIC) rose about 0.4%.\n\nMarkets are also on alert for any sign that the US has joined the Middle East conflict, which has swung stocks around since it broke out last week. President Trump demurred Wednesday when asked if he's moving closer to bombing Iran. \"I may do it. I may not do it. I mean, nobody knows what I’m going to do,\" he said.\n\nIran has warned it will respond firmly if the US crosses a red line into involvement and has reportedly readied missiles for strikes on US bases in the region if it does.\n\nOil prices moved over 1% higher, reversing course after the morning's decline. Brent futures (BZ=F), the international benchmark, were roughly flat at $76 a barrel while West Texas Intermediate (CL=F) crude traded just below $75.\n\nRead more: The latest on Trump's tariffs\n\nMeanwhile, weekly jobless claims remained near their highest level in eight months.\n\nLIVE\n\n22 updates",
        "source_domain": "finance.yahoo.com"
    },
    {
        "url": "https://finance.yahoo.com/news/corn-getting-spillover-support-wheat-172158799.html",
        "title": "Corn Getting Spillover Support from Wheat",
        "content": "Corn harvest - by ulleo via Pixabay\n\nCorn futures are showing some continued bear spreading on Wednesday, with July down ¼ cent ahead of Friday’s options expiration, as other contracts are up 4 to 5 cents. Support is coming from a rally in the wheat market. The front month CmdtyView national average Cash Corn price is down 1/4 cents at $4.08.\n\nThe weekly EIA report showed ethanol production dropping back by 11,000 barrels per day from the previous record to 1.109 million barrels per day. Ethanol stocks across the US were back up 386,000 barrels to 24.12 million barrels. Ethanol exports were up 12,000 barrels per day to 163,000 bpd, with refiner inputs of ethanol up 5,000 bpd to 910,000 bpd.\n\nMore News from Barchart\n\nThe markets will be closed on Thursday in observance of Juneteenth, with the government closed as well and reports pushed back a day. Export Sales data will be out on Friday morning, with traders looking for 600,000 MT to 1.2 MMT in corn bookings for 2024/25 in the week ending on June 12. New crop business is seen at 0-200,000 MT.\n\nJul 25 Corn is at $4.31 1/4, down 1/4 cent,\n\nNearby Cash is at $4.08, down 1/4 cent,\n\nSep 25 Corn is at $4.28 1/4, up 4 1/2 cents,\n\nDec 25 Corn is at $4.43 1/2, up 4 3/4 cents,\n\nNew Crop Cash is at $4.01 1/2, up 4 1/2 cents,\n\nOn the date of publication, Austin Schroeder did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. This article was originally published on Barchart.com",
        "source_domain": "finance.yahoo.com"
    },
    {
        "url": "https://finance.yahoo.com/news/archer-aviation-betting-big-fledgling-171303847.html",
        "title": "Archer Aviation Is Betting Big on Its Fledgling Defense Business. Does That Make ACHR Stock a Buy Here?",
        "content": "Drone flying by Pexels via Pixabay\n\nValued at a market cap of $5.5 billion, Archer Aviation (ACHR) designs and develops aircraft and related technologies in the U.S. It is a prominent player in the emerging electric vertical takeoff and landing (eVTOL) industry, and has struck commercial deals aimed at transforming urban air mobility (UAM). Although its flagship eVTOL is still going through rigorous testing and securing regulatory approval before commercial launch, Archer is working to secure business in advance.\n\nAnd, in recent months, the company is also quickly building out its defense business.\n\nMore News from Barchart\n\nwww.barchart.com\n\nArcher Aviation is strategically pivoting toward defense contracts as commercial air taxi deployment faces extended timelines. In fact, CEO Adam Goldstein recently predicted that defense could become “the biggest part of our business” in the near term. The electric aircraft manufacturer’s shift reflects broader industry trends, as air taxi developers confront slower-than-expected progress in launching passenger services.\n\nOn the flip side, President Donald Trump is ramping up military spending with a focus on defense innovation. This presents Archer with an opportunity to capitalize through strategic partnerships, including its collaboration with weapons maker Anduril Industries to develop hybrid-fueled military aircraft.\n\nArcher secured its first major defense contract in 2023, partnering with the U.S. Air Force to provide quieter, cost-effective eVTOLs for supply delivery and non-combat applications. This positions the company to capture immediate revenue while commercial markets mature.\n\nBloomberg Intelligence analysts project that fewer than 30,000 air taxis will be flying by 2040, a level that would be unprofitable, requiring companies to diversify into defense, cargo, and hybrid variants. This tepid forecast validates Archer’s defense-focused approach, as traditional air taxi timelines extend beyond initial projections.\n\nThe defense pivot offers Archer near-term revenue potential while maintaining long-term commercial opportunities. However, investors should consider execution risks and the company’s ability to navigate defense contracts and eventual commercial scaling.\n\nArcher Aviation Sets Sights Abroad, on Defense\n\nArcher Aviation ended Q1 2025 with more than $1 billion in cash, providing it with a substantial runway for its ambitious commercialization plans. Its UAE deployment remains on track for late 2025, with the first Midnight aircraft currently in flight testing before delivery.",
        "source_domain": "finance.yahoo.com"
    },
    {
        "url": "https://finance.yahoo.com/news/prediction-losing-more-1-trillion-170800338.html",
        "title": "Prediction: After Losing More Than $1 Trillion in Market Cap Earlier This Year, This Monster Artificial Intelligence (AI) Stock Will Become the Most Valuable Business in the World by the End of the Ye",
        "content": "Well, throughout the month of March, investors were more or less guessing whether President Donald Trump would, in fact, impose heavy tariffs on America's trading partners -- something he had often promised to do while campaigning.\n\nInvestors came to recognize that the existence of DeepSeek might not represent a major threat to Nvidia's business after all. Yet its shares continued to slide. Why?\n\nAs more information about DeepSeek emerged, however, it became clear that the company may not have been entirely upfront about how it trained its model , or what the the real cost of doing so was.\n\nInitial reporting took DeepSeek management at its word when it asserted that it had developed its highly sophisticated R1 model at an incredibly low price relative to competing AI models, and had done so entirely with older Nvidia chip architectures that aren't widely used by U.S. developers anymore. This caused many onlookers to question just how essential Nvidia's most advanced GPUs would prove to be for AI development and training broadly, and whether demand for its new Blackwell series of chips would be as strong as had been projected.\n\nThe chart below illustrates the fluctuations in Nvidia's market cap throughout 2025. The volatility in the stock in January and February was triggered by the emergence onto the scene of Chinese AI start-up DeepSeek .\n\nLet's explore what drove the sell-off in Nvidia to begin with. From there, I'll explain why investor enthusiasm for the chip designer is on the rise and detail why I think the stock is poised for an epic breakout during 2025's second half.\n\nHowever, Nvidia stock has rebounded over the last month or so and has almost fully recovered from that decline.\n\nWhile the graphics processing unit (GPU) king's market capitalization peaked early this year at nearly $3.7 trillion, a months-long slide that bottomed out in April shaved about $1.4 trillion off its value.\n\nMegacap technology companies have been some of the biggest movers and shakers in the stock market throughout 2025. Among the hottest stocks in the artificial intelligence (AI) realm is Nvidia (NASDAQ: NVDA), but it has been struggling this year.\n\nNvidia stock has been on a roll over the last several weeks, and I think it could keep rising.\n\nThis year's sell-offs in Nvidia stock were primarily driven by uncertainty about what DeepSeek's AI model means for long-term GPU demand and fears over the impact of President Donald Trump's tariffs.\n\nStory Continues\n\nOn April 2, Trump declared what he called \"Liberation Day,\" unveiling steep new tariffs on goods imported from nearly every country in the world. His threatened tariffs on China, a market that Nvidia relies heavily on for growth, were particularly high.\n\nIn the wake of that news, Nvidia sank to its 2025 low.\n\nImage source: Getty Images.\n\nWhy Nvidia's comeback could accelerate in the second half\n\nAs the stock chart above makes clear, investors appear to have hopped back onto the Nvidia train over the last several weeks. At a high level, one might suggest that developments in the trade negotiations between the U.S. and China may have eased investor tension.\n\nWhile I understand that idea in theory, I think there is more to the picture. Despite the positive rhetoric from the White House about the status of its talks with China, Nvidia's management recently notified investors that the company will be excluding China from its financial guidance for the time being.\n\nInstead, I see a couple of other reasons why investors may be piling back into the stock.\n\nAI infrastructure is on the rise\n\nYou may recall that earlier this year, executives from Oracle, OpenAI, and SoftBank met at the White House to announce a large-scale infrastructure initiative called the Stargate Project.\n\nThe members of the joint venture intend to make a collective investment of $500 billion over four years into U.S.-based data centers and various other infrastructure specifically designed to support AI. Nvidia was named as a key technology partner in the project, along with Microsoft, Arm, Oracle, and OpenAI.\n\nElsewhere, the Kingdom of Saudi Arabia and the United Arab Emirates have begun their own Stargate-like initiatives, in which Nvidia has already become involved.\n\nDiversifying the ecosystem\n\nFor most of its history, Nvidia has been known as a hardware business. What some investors may not realize, however, is that the company has been quietly diversifying its ecosystem for years.\n\nFor example, Nvidia has developed a software platform called CUDA that allows developers to program its GPUs for the specific uses they require and get the most out of their parallel-processing power. This integrated system has helped Nvidia become an end-to-end service provider for AI developers, as it offers industry-leading hardware and software. In addition, Nvidia has made a number of investments in recent years -- particularly in AI infrastructure leaders CoreWeave and Nebius Group.\n\nI see these investments as highly strategic, as Nvidia is moving beyond designing hardware and software to become a critical player in AI data center construction, too. It has swiftly become a full-stack provider of AI services, making it harder for peers such as Advanced Micro Devices or custom silicon designers to catch up.\n\nTaking this one step further, Nvidia's management has suggested that the company might use some of its robust and rising earnings to make acquisitions. While this is speculative, I think if Nvidia does pursue acquisitions, these deals will be focused on emerging areas such as robotics or autonomous driving that Nvidia could penetrate to diversify its business beyond its GPU and data center operations.\n\nWhere will Nvidia stock be by the end of the year?\n\nCurrent analyst sentiment surrounding Nvidia stock suggests that shares could be headed for a breakout. With a market cap of more than $3.5 trillion, Nvidia has been trading the title of world's most valuable company back and forth with Microsoft over the past month.\n\nThe bigger idea I want to drive home is that the secular trends fueling AI infrastructure investment and Nvidia's ongoing efforts to expand beyond chip design are the core reasons I think the company will not only continue rising in value but actually sustain its lead over other megacap peers in the months ahead.\n\nShould you invest $1,000 in Nvidia right now?\n\nBefore you buy stock in Nvidia, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $658,297!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $883,386!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 995% — a market-crushing outperformance compared to 173% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of June 9, 2025\n\nAdam Spatacco has positions in Microsoft and Nvidia. The Motley Fool has positions in and recommends Advanced Micro Devices, Microsoft, Nvidia, and Oracle. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n\nPrediction: After Losing More Than $1 Trillion in Market Cap Earlier This Year, This Monster Artificial Intelligence (AI) Stock Will Become the Most Valuable Business in the World by the End of the Year was originally published by The Motley Fool",
        "source_domain": "finance.yahoo.com"
    }
]