{
  "https://gov.illinois.gov/news/press-release.31247.html": {
    "text": "Press Releases\n\nRivian solidifies its commitment to Illinois with a $120 million investment in a supplier park, creating nearly 100 new direct jobs and hundreds of future jobs from suppliersNORMAL -Governor JB Pritzker and Rivian today announced that the company is constructing a new 1.2 million-square-foot supplier park in Normal. As part of this, Rivian will invest nearly $120 million, which will enable the company to develop the supplier park and create nearly 100 new direct jobs. This significant investment will pave the way for EV suppliers to locate in the park and create hundreds of new jobs while bolstering the supply chain and manufacturing ecosystem in Illinois. Construction on the supplier park is underway and is expected to be completed in 2026.\"In Illinois, we aren't just making electric vehicles: we are creating an entire ecosystem - attracting investments, bolstering our workforce, and strengthening the EV manufacturing supply chain,\"said Governor JB Pritzker.\"Rivian's investment will attract suppliers from across the globe to invest in Illinois and continue to create good-paying jobs, providing Illinois with the competitive edge to thrive in the clean energy economy.\"\"We are excited to see this supplier park coming together so quickly,\"said Rivian Founder and CEO RJ Scaringe.\"This will be a key enabler to increasing production at the plant in 2026 when we start to build R2 in addition to R1 and our commercial vans. We are grateful to Governor Pritzker and the state's partnership, and are looking forward to welcoming suppliers at the new space.\"The park will allow the company to co-locate suppliers that produce component parts for Rivian vehicles, with the parts transported across Highway 150 to the company's main facility for assembly into the final R1 and R2 Rivian models. Hosting key suppliers nearby will help Rivian fortify their supply chain, which increases consistency and continuity in the manufacturing process.\"Rivian's latest investment in Illinois is a clear reflection of the state's growing leadership in the clean energy economy,\"said DCEO Director Kristin Richards.\"Illinois is committed to building a sustainable future, supporting innovation, and expanding access to high-quality jobs, especially in the electric vehicle sector.\"Rivian's investment was supported by a $16 million incentive package, which includes a Reimagining Energy and Vehicles (REV Illinois) tax incentive valued at $5 million over the course of 20 years. The remaining incentive package primary consists of capital grant support. The REV Illinois agreement specificizes the creation of a minimum of 93 full time jobs and a $119.6 million investment. A link to the executed Rivian agreement can be found on theDCEO website.\"Illinois has long been a leader in clean energy manufacturing, and Rivian's new $120 million investment underscores the strength of our electric vehicle ecosystem,\"said Intersect Illinois President and CEO Christy George.\"We are proud to see Rivian grow right here in Illinois, and we look forward to supporting Rivian's suppliers who are building the future of clean energy and advanced manufacturing.\"\"Rivian's continued growth benefits Bloomington-Normal and the surrounding region,\"said Town of Normal Mayor Chris Koos.\"The Town of Normal is excited about the positive impact this will have on our community. We look forward to a bright future of innovation and collaboration.\"\"With the creation of this new supplier park and investment from Illinois, Gov Pritzker and Rivian, Bloomington and our surrounding community has the potential for more job creation and Economic development,\"said Bloomington Mayor Dan Brady.\"This is one of the most exciting investments our region has seen — cementing Normal as a national leader in clean energy and putting us at the forefront of the electric vehicle revolution,\"said Assistant Majority Leader Dave Koehler (D-Peoria).\"We're grateful to Rivian for their continued commitment to our community and workforce.\"\"Normal is quickly becoming one of Illinois' top centers of innovation, and Rivian's expansion takes us to the next level — building a premier hub for advanced manufacturing and opportunity,\"said Representative Sharon Chung (D-Bloomington).\"Thank you to Rivian for believing in Normal and helping shape our future.\"\"We are grateful to RJ & Rivian, for their continued investment in Normal. This expansion is a testament to Central Illinois' workers, infrastructure and the economic development professionals of Team Illinois! Thank you to Governor Pritzker, our State and local elected, and DCEO for creating the incentive tools needed to bring projects like this home. We look forward to supporting Rivian's growth for years to come,\"said Bloomington-Normal Economic Development Council President and CEO Patrick Hoban.Last year, Governor Pritzker joinedRivian to announcea historic $1.5 billion investment from the company to build its highly anticipated R2 model at its Normal facility and create more than 550 full-time jobs.The REV Illinois program supports a targeted industry for the state - clean energy production and manufacturing - which continues to grow with assistance from Illinois' leadership and their support of innovative technologies that reduce costs and emissions. REV Illinois offers competitive incentives for companies all along the supply chain in the electric vehicle and renewables sector to expand in or relocate to Illinois, including future companies that will locate in the supplier park.\n\nPress Releases"
  },
  "https://rivian.com/newsroom": {
    "text": "Want to see what we're up to?Get updates from Rivian.\n\nR1S\n\nR1T\n\nR2\n\nR3\n\nFleet\n\nDemo Drive\n\nSign In\n\nFebruary 10, 2025\n\nMay 5, 2025\n\nApril 16, 2025\n\nMarch 26, 2025\n\nFebruary 10, 2025\n\nJanuary 16, 2025\n\nDecember 16, 2024\n\nDecember 5, 2024\n\nNovember 25, 2024\n\nAugust 13, 2024\n\nJune 25, 2024\n\nJune 6, 2024\n\nMay 2, 2024\n\nApril 26, 2024\n\nMarch 7, 2024\n\nDecember 14, 2023\n\nTHE BEGINNING\n\nLearn about our company\n\nFOUNDER AND CEO\n\nLearn about our leadership team\n\nPHILANTHROPY\n\nLearn more about Forever\n\nHEADQUARTERS\n\nLearn about our locations\n\nTHE PLANT\n\nLearn about our locations\n\nINITIAL PUBLIC OFFERING\n\nLearn about our NASDAQ debut"
  },
  "https://riviantrackr.com/news/": {
    "text": "Rivian has confirmed pricing for the 2026 model-year R1T and R1S. While the updates are modest, there are slight increases across nearly every configuration. Full specs, options, and accessory details for the 2026 vehicles are expected to drop closer to the start of sales later this summer. Here’s what’s changing. R1S Configuration Current Price 2026 Price Difference Dual-Motor Standard $75,900 $76,990 +$1,090 Dual-Motor Large $83,900 $83,990 +$90 Dual-Motor Max $89,900 $90,990 +$1,090 Tri-Motor Max $105,900 $106,990 +$1,090 R1T Configuration Current…"
  },
  "https://www.forbes.com/sites/greatspeculations/2025/05/28/rivians-growth-story-screeches-to-a-halt/": {
    "text": "ByDavid Trainer,\n\nContributor.\n\nSouth San Francisco, CA, USA - May 1, 2022: A new Rivian R1T truck is seen at a Rivian service... Morecenter in South San Francisco, California. Rivian Automotive, Inc. is an electric vehicle automaker.\n\nAfter a weekend marked by Warren Buffett officially announcing his departure from Berkshire Hathaway, investors are reminded of the importance of disciplined, fundamentals-based investing. Now, perhaps more than ever, investors need to be diligent in an increasingly speculative market.\n\nThis week’s Danger Zone pick is one stock that, after doing due diligence, is not worth owning. The company is burning cash at zombie stock-like levels, yet its valuation implies massive profit growth and a near quadrupling of the business’ market share. That disconnect is dangerous to any portfolio.\n\nI originally put Rivian (RIVN) in the Danger Zone on October 22, 2021 prior to its IPO. I’ve reiterated my bearish opinion on the stock multiple times since then.\n\nSince its IPO, this Danger Zone pick outperformed as a short, but this stock remains dangerous. The company’s growth is slowing, yet its stock was up over 50% last year.\n\nI’m here to remind you, as the market attempts to rally in recent days, that some very unprofitable businesses remain highly overvalued. Rivian’s stock price remains far too expensive at current levels.\n\nFigure 1: Rivian Outperformance as a Short From 11/10/21 Through 5/2/25\n\nRIVN Performance Since Nov 2021\n\nRivian’s vehicle deliveries grew 3% year-over-year, from 50,122 in 2023 to 51,579 in 2024. The increase in deliveries helped Rivian grow its revenue 12% YoY in 2024.\n\nRivian produced 14,611 and delivered 8,640 vehicles in 1Q25, which topped the company’s previous guidance for ~14,000 vehicles produced, and 8,000 vehicles delivered. For the full year 2025, the company guided for a delivery range of 46,000 to 51,000.\n\nWhen I dig below the surface, I find that the company’s fundamentals remain poor and the stock continues to be overvalued, as I’ll show below.\n\nBulls have tried to justify Rivian’s large losses by arguing that the company is in its high-growth, ramp up phase.\n\nHowever, the company’s deliveries (EV’s sold) grew just 3% YoY in 2024, compared to 147% YoY growth in 2023. Going forward, Rivian’s new guidance of 46,000 to 51,000 deliveries for 2025 would, at the high-end, represent a YoY decline in vehicles delivered in 2025. The growth in this “growth-story” simply isn’t there.\n\nOn a quarterly basis, Rivian’s U.S. deliveries fell from 13,588 in 1Q24 to 8,553 in 1Q25, a 37% YoY decrease.\n\nRivian’s production also dropped in 2024. Despite initial production guidance for 57,000 vehicles in 2024 (which would have been flat YoY), the company managed to produce only 49,476 vehicles, which was down 13% YoY.\n\nRivian is not keeping pace and is losing market share in the U.S. After growing its U.S. market share from 0.4% in 1Q22 to its peak 5.0% in 3Q23 (and in 1Q24), Rivian’s market share has fallen to 2.9% in 1Q25. See Figure 2.\n\nFigure 2: Rivian’s U.S. Market Share: 1Q22 – 1Q25\n\nRIVN Market Share 1Q22-1Q25\n\nI originally named Rivian a Zombie Stock in August 2022 as the company could sustain its cash burn rate for just 10 months at the time without additional capital or a significant slowdown in cash burn.\n\nHowever, I removed the stock from the Zombie Stock List in July 2024, after Volkswagen announced an investment of $5 billion, which later turned into nearly $6 billion and a joint venture between the two companies. The large investment, and backing of Volkswagen, diminished the likelihood of a bankruptcy for Rivian.\n\nFast forward to early 2025, and Rivian still has all the markings of a Zombie Stock even after the recent investment, as I’ll show below.\n\nSince 2020, Rivian has burned $32.5 billion (159% of enterprise value) in free cash flow (FCF) excluding acquisitions. See Figure 3. Rivian burned $8.1 billion in FCF in the last two years alone.\n\nNot surprisingly, the company’s economic earnings, the true cash flows of the business that take into account changes to the balance sheet, fell from -$692 million in 2019 to -$6.3 billion in 2024.\n\nDespite having $7.7 billion of cash on hand as of December 31, 2024, Rivian can only sustain its 2024 cash burn rate for 22 months from the end of April 2025. Additionally, Rivian’s interest coverage ratio is currently -13.6.\n\nRivian meets all the criteria of a Zombie Stock, but I’m not putting it back on the list is because I think Volkswagen is likely to provide additional investment and would not let Rivian go bankrupt.\n\nIf Rivian’s business doesn’t improve, and Volkswagen slows its investment in the company, I’ll be ready to add it back to the Zombie Stock list.\n\nFigure 3: Rivian’s Cumulative FCF: 2020 – 2024\n\nRIVN Free Cash Flow - 2020-2024\n\nNot only does Rivian continue to burn billions in cash, but its operations also remain far from breakeven.\n\nThe company’s total operating costs, which include cost of revenue, R&D, and SG&A were 229% of revenue in 2023 and 194% in 2024. I would expect Rivian’s operating costs to remain high as the company continues to build out production capacity and aim to take market share.\n\nWith total operating costs nearly twice as high as its revenue, it’s no surprise Rivian is racking up losses.\n\nThe company’s net operating profit after-tax (NOPAT) declined from -$399 million in 2019 to -$4.6 billion in 2024. See Figure 4.\n\nFigure 4: Rivian’s NOPAT Since 2019\n\nRIVN NOPAT: 2019-2024\n\nOf the 55 Automobiles & Auto Parts companies under my firm’s coverage, only four have a lower return on invested capital (ROIC) than Rivian. Fellow EV manufacturer and Danger Zone pick Nio Inc. (NIO) is one of them.\n\nThe legacy car makers have proven their ability to enter and take EV market share. For instance, Ford (F) and Chevrolet (owned by General Motors) hold 7.7% and 6.5% share of the US. EV market in 1Q25. These auto manufacturers generate billions in profits through their legacy and hybrid offerings that they can then pour into EVs to take market share while remaining profitable. The path for Rivian to achieve lasting profitability while also taking market share looks increasingly challenging.\n\nPer Figure 5, Rivian’s NOPAT margin, invested capital turns, and ROIC all rank near industry lows. The gap between the industry leaders and laggards is particularly stark. I don’t think it is a coincidence that the laggards are relatively new EV-focused vehicle manufacturers.\n\nFigure 5: Rivian’s Profitability Vs. Competitors: TTM\n\nRIVN Profitability Vs Peers\n\nAfter analyzing Rivian’s latest 10-K, it earns a very unattractive Credit rating in three of the five metrics that drive my Overall Credit Rating, As a result. Rivian earns an unattractive Credit Rating. See Figure 6.\n\nWith negative EBITDA to Debt, FCF to Debt, and Interest Coverage, it could be more difficult for Rivian to raise additional capital without significantly diluting existing investors, especially given the current uncertain market conditions.\n\nFigure 6: Rivian’s Credit Rating Details\n\nRIVN Credit Rating Details\n\nBelow, I use myreverse discounted cash flow (DCF) modelto analyze the future cash flow expectations baked into Rivian’s stock price. Rivian’s stock is priced as if it will significantly improve profitability while nearly quadrupling its market share in the U.S. EV market. I also present an additional DCF scenario to highlight the downside risk in the stock if Rivian fails to achieve these overly optimistic expectations.\n\nTo justify its current price of $14/share, my model shows that Rivian would have to:\n\nIn this scenario, Rivian would generate $124.4 billion in revenue in 2035, which is 148%, 134%, 92% of Nissan’s (NSANY), Tesla’s (TSLA), and Honda Motor’s (HMC) TTM revenue, respectively. It would also equal 25x Rivian’s 2024 revenue.\n\nThis scenario also implies that Rivian would generate $5.0 billion in NOPAT in 2035, which would equal 130% of Tesla’s 2024 NOPAT and 153% of Nissan’s TTM NOPAT, compared to the company’s -$4.6 billion NOPAT in 2024.\n\nIf I assume automotive revenue remains 90% of total revenue, as in 2024, then Rivian would generate $112.3 billion in automotive revenue in 2035 in this scenario. This revenue figure implies Rivian will sell the following number of vehicles based on these ASPs:\n\nNext, I can analyze the implied U.S. market share for the sales volumes above based on the total estimated number of new EV sales in 2035, according to data compiled by Edison Electric Institute (EEI).\n\nThe vehicle sales noted above would represent the following implied U.S. market share in 2035:\n\nThe likelihood of achieving any of these market share scenarios is unlikely in such a competitive industry. For reference, at an ASP of $56k, Rivian would have to sell 2.0 million vehicles in 2035, or more than the 1.8 million vehicles Tesla sold in 2024.\n\nFor reference, the two best-selling vehicles, not just EVs, in the U.S. in 2024 were the Toyota RAV4 with ~475,000 sales and the Ford F-150 with ~470,000 sales. In other words, to justify its valuation, Rivian must maintain an ASP well above average new-vehicle prices, while, in 2035, selling more vehicles than the two top selling models combined in 2024, while also fending off competition from all other automakers.\n\nFigure 7: Rivian’s Implied Vehicle Sales in 2035 to Justify $14/Share\n\nRIVN DCF Implied Sales\n\nIf I instead assume Rivian:\n\nmy model shows the stock would be worth just $4/share today – 71% downside to the current price. In this scenario, Rivian’s NOPAT would still grow to $2.2 billion, which is 57% of Tesla’s 2024 NOPAT and 67% of Nissan’s TTM NOPAT.\n\nAt its current ASP, assuming automotive revenue remains 90% of revenue, this scenario implies Rivian will sell over 568,000 vehicles in 2035. In other words, Rivian would sell 20% more vehicles in 2035 than the Toyota RAV4, the most sold vehicle in the U.S. in 2024.\n\nFigure 8 compares Rivian’s implied future NOPAT in these scenarios to its historical NOPAT. For additional comparison, I include the 2024 NOPAT of Tesla (TSLA) and Nissan (NSANY).\n\nFigure 8: Rivian’s Historical and Implied NOPAT: DCF Valuation Scenarios\n\nRIVN DCF Implied NOPAT Scenarios\n\nEach of the above scenarios assumes Rivian grows revenue, NOPAT and FCF without increasing working capital or fixed assets. This assumption is highly unlikely but allows me to create best-case scenarios that highlight the unrealistically high expectations embedded in the current valuation. For reference, Rivian’s invested capital grew 42% compounded annually from 2019 through 2024. If I assume Rivian’s invested capital increases at a similar rate in the DCF scenarios above, the downside risk is even larger.\n\nGiven that the performance required to justify its current price is overly optimistic, I dig deeper to see if Rivian is worth buying at any price. The answer is no.\n\nThe company has $5.0 billion in total debt, $447 million in outstanding employee stock options, and no excess cash. Rivian has an economic book value, or no-growth value, of -$39/share. In other words, I do not think equity investors will ever see $1 of economic earnings under normal operations, which means the stock would be worth $0 today."
  },
  "https://www.torquenews.com/17998/i-drive-lucid-air-gt-and-rivian-r1s-each-his-own-only-one-car-makes-sense-780-mile-trips": {
    "text": "As Tesla continues to dominate the electric vehicle landscape, two ambitious challengers, Rivian and Lucid, are quietly building momentum from opposite ends of the EV spectrum.Rivian and Lucid Motors, California’s clean-energy cowboys, are building their electric dreams while Tesla continues to suck all the oxygen out of the EV room.\n\nThese two upstarts want to dethrone the king. They’re leaner, faster, and free of the bureaucracies that slow giants like Tesla.And when you own both, a Lucid Air Grand Touring and a Rivian R1S, you’re not just a bystander. You’re an embedded war correspondent, watching this electric arms race unfold from the front seat.\n\nInsider’s EV Road Trip Perspective, Lucid Air GT vs Rivian R1S\n\nOne of the most telling perspectives comes from aLucid Owners Forum user, BS8899, who’s lived the EV road trip life with both a Lucid Air Grand Touring and a Rivian R1S. His firsthand account is a raw, detailed logbook from someone who’s put thousands of real miles on both vehicles.\n\n“Background:\n\nI have two homes, one in Phoenix, AZ, and one in Sausalito, CA.\n\nBefore my (now) 2nd home in Sausalito, I had a 2nd home in Rancho Palos Verdes (LA suburb) when my son was going to school at USC.\n\nI regularly drove the Phoenix to LA route (400 miles, door-to-door) and now, I drive the Phoenix to Sausalito (~780 miles, door-to-door) route.\n\nI am a strong EV advocate. My home in Phoenix has been 100% solar-powered and wired for EV charging since 2008. Sadly, no pure EV was worth buying until the 2020s. I had a gas hybrid (2017 Lexus RX450H), and a 2019 Honda Clarity (PHEV), now my son’s car. Currently, I drive a 2022 Lucid AGT and a 2023 Rivian R1S.\n\nI want to share my perspectives about taking long road trips in a hybrid, a PHEV, and two different EVs. Nothing profound. Just some real-life experience and numbers for long road trips.\n\nFraming:\n\nI don’t intend to get into debates with anyone about the efficiency (miles/kWh) of EVs and whether it is related to the square or cube of the speed, etc., drag coefficients, elevations, etc., etc.. Enough has already been said by many forum participants. Mostly, I loosely follow the speed limit, between 70-80mph on I-10 and I-5. In short, if you drive fast, your efficiency will be (substantially) lower than the EPA and what you wish for. There are a lot of nuances beyond just the drag factor and the speed. That’s just life! Suck it up!\n\nIn Perspective:\n\nI drove my Lexus on many trips to LA and to Sausalito. In short, the Lexus performed flawlessly over a 6-year period. It gets ~28-29 miles/gallon. Its driver assist functions (lane-keep, adaptive cruise control, etc.) are on par with all the other cars, even though the Lexus is 5-6 years older than the Lucid and the Rivian (see below). I had ZERO problems with the Lexus over a 6+ year ownership. It was a quality car! The trip from Phoenix to LA takes ~6hrs, non-rush hour, 1X gas refill. Trip from Phoenix to Sausalito takes ~11hrs (no traffic), 2X refill. Cost of gas ~$120-140 (@$4.50/gallon avg) for the Phoenix to Sausalito trip, depending on the prevailing gas price.\n\nThe Honda Clarity is the best-balanced car if you want EV economy/convenience and no anxiety on long drives. It gets 45+ EV miles (rated @47 miles) range when fully charged. I can get around town on EV-only and never needed any gas until I got on the road between LA and Phoenix. There, I used the “mixed mode” with EV and gas. It gives a good balance between power and economy. Trips between Phoenix and LA take 6hr, 2X refill (The Clarity only has a 7-gallon gas tank). The cost of gas is <$55 for the Phoenix to LA trip. I love this car!\n\nI bought the Lucid AGT (19” wheels) in Nov 2022, mostly because of the advertised range (EPA range rated at 516 miles). It is the longest-range EV around. In reality, it barely covers the 400-mile distance between Phoenix and LA. True, there are elevation changes (e.g., San Bernardino Mts, etc.) and highway speed (70-80 mph) that wreak havoc on your EPA range. On over 7,000 miles of driving the Lucid, the efficiency is ~3.6 miles/kWh. Pure highway driving (70-80 mph) is ~2.9-3.0 miles/kWh. The cost of charging for the Phoenix to Sausalito trip is ~$150-$160 with Electrify America (@56c/kWh). Free, if you have a free charging station.\n\nOn the Phoenix to Sausalito trips (780 miles), it takes ~12 hrs. The Lucid can make it with 2 charging stops. But you need to plan carefully. I arrived in Sausalito (from Phoenix) with 2 charging stops, with <5% SoC upon arrival! One good thing about the Lucid is its fast charging, unless your charging rate is limited by Electrify America throttling, and it happens often!\n\nThe ground clearance of the Lucid is incredibly low. That’s how they get the drag coefficient down. Mechanically, this car is a thrill to drive. The interior is comfortable. But you must be extremely careful not to go over bumps fast or park too close to the curb! The infotainment and SW are sub-par! The navigation is barely functional and laggy. I must resort to my phone navigation on several occasions.\n\nThe Rivian is built like a tank! It is rugged and rides high. It is reasonably comfortable, though not luxurious. With the large pack (battery), it is rated at ~321 miles (road tires, quad motor). You can squeeze out another 15 miles or so using Conserve mode (FWD only). From my experience and other Rivian owners’ reports, the efficiency is close to 2.3 miles/kWh, higher than the 2.0 miles/kWh claimed by Rivian. It can pull 7,000 lbs and carry a lot of stuff! It rides high and can handle rough roads. The 3rd row seats are not that bad, though I won’t ride the 3rd row for a 13-hour trip. The SW and infotainment system is superior to those in Lucid’s. The navigation is excellent, the destination search is very informative and far better than Lucid’s.\n\nIf your trips are less than 550 miles, you can do it with 2 charges. But my Phoenix to Sausalito trip requires 3 (or even 4) charging stops. But if you like rough roads and 4-wheeling, Rivian is the only (EV) way to go!\n\nRivian has its own “Adventure” charging network. It used to be free (ended Nov 2023). Rivian now charges a uniform 36 cents/kWh. These DC chargers are rated at 300kW. My experience is that every single one worked, and they don’t throttle, far better than Electrify America! And Rivian charger’s rates (36 cents/kWh) are MUCH cheaper than Electrify America (and Tesla)! On paper, the Rivian does not charge as fast as the Lucid per the charging specs. In reality, the Lucid does charge faster, but the difference in actual charging time is not as big as the specs suggest since the Lucid’s peak charging rate is only relevant over a small SoC range (e.g., from 20% to say 40%). Nevertheless, taking the Rivian on the 780-mile journey will result in an additional stop (or two) and 35 minutes or more. The cost of charging is ~$130-135 (@36c/kWh) if you use all Rivian Adventure charging stations.\n\nIn conclusion, if I only have one car and I need to do long-distance driving, I’d opt for a PHEV. The Lucid AGT’s range and fast charging are pluses for long road trips, and fun to drive. It saves 1 to 2 charging stops and ~1+hr of travel time on a 780-mile trip. But the Lucid has the highest fuel cost (if you must pay for it). The navigation system is quirky, laggy, and almost useless. The Rivian R1S is roomy and rugged. Best for family/dogs, camping, 4-wheeling, and hauling things. Its range and efficiency are not as good as the AGT. However, the Rivian Adventure chargers are great and about 30-45% cheaper than Electrify America and Tesla chargers. According to Rivian, its Adventure Charging Stations use renewable energy such as solar and wind.\n\nApologies for the long, rambling post. To each his own!”\n\nThe Lucid delivers strong range and serious speed, no question. It’s quick, comfortable, and built for covering ground. But it also comes with strings attached.\n\nIts performance depends heavily on external factors, especially the charging network. Electrify America is still rolling the dice at scale,and Lucid’s otherwise heroic fast-charging is frequently held hostage by throttled stationsand software lag. It’s a car that can do incredible things if the stars align.\n\nLucid Air Touring vs Rivian R1S: Dimensions, Performance & Range Comparison\n\nContrast that with the Rivian R1S. Where the Lucid glides and whispers, the Rivian thuds and climbs. It's an electric SUV that acts like it was raised on a steady diet of Moab and national parks.The same forum user reports ~2.3 mi/kWh on his long hauls, modest efficiency, yes, but redeemed by a charging experience that just works.\n\nRivian’s Adventure Network may not match Tesla’s Supercharger sprawl, but it’s dependable, cheaper (at 36 cents/kWh), and doesn’t suffer from the throttling games that plague Electrify America.“Every single one worked,”he wrote. That line alone is worth ten thousand marketing brochures.\n\nAnd then there’s Tesla. The elephant in the showroom. You can hate the CEO or roll your eyes at the fanboys, but Tesla still owns the infrastructure game, and that matters. When you’re number one, you defend your turf with relentless scale. Tesla’s OTA updates land with surgical consistency. Its Superchargers are still the benchmark. And as the road-tripping stakes rise, the ease and reliability of a Tesla experience is enough to make you forgive the odd panel gap or clunky yoke.\n\nTesla’s Charging Infrastructure, The Benchmark in EV Road Tripping\n\nYet where Tesla is an empire, Lucid and Rivian are artisans. The Lucid is for those who want their electric miles wrapped in leather and low-drag curves. The Rivian is for people who want to throw a canoe on top and still have room for the dog. “To each his own,” BS8899 says. And he means it. The Lucid delivers stunning speed, whisper-quiet comfort, and legitimate long-range credentials, if you’re willing to meticulously plan your charging. The Rivian adds time at the plug, sure, but you won’t be worrying if the charger works when you get there.\n\nThe irony, of course, is that both Lucid and Rivian succeed by doing what Tesla once did best: disrupting entrenched thinking. Lucid went after range and ride. Rivian went after lifestyle and utility. And both companies appeal to customers who’ve grown tired of software bugs masquerading as features. Tesla once sold an idea of freedom. These two now sell the idea of control, of knowing your car, knowing your trip, and not having to hack around your navigation with a second phone.\n\nRivian Adventure & Lucid Charging: Network Speeds, Home Charging & Sales Models\n\nSo, which one wins the 780-mile war from Phoenix to Sausalito? BS8899 lays it out without bias: the Lucid is faster, saves a charge stop, and eats highway miles with grace, but it demands your attention.\n\nThe Rivian is slower, boxier, and thirstier, but it asks less of you. It’s rugged, consistent, and well-suited to families and dirt roads. Both vehicles reflect different answers to the same question. What do EV drivers actually want from a road trip machine?\n\nEV Road Trip Verdict: Choosing Between Lucid Air GT, Rivian R1S, and Tesla\n\nTesla may still sit at the top of the EV world, but Rivian and Lucid aren’t just chasing anymore, they’re starting to show up as real options for serious buyers. The throne isn’t empty, but it’s starting to shake. Lucid makes its case with range and refinement, while Rivian leans into versatility and dependability.\n\nAnd Tesla? It’s still the standard, mostly because everything around it, charging, software, the overall experience, just works. The real question now is how long it can stay ahead while these younger players close the gap, mile by mile.\n\nWhat matters most to you on a long journey? Is it pure range and speed, or would you trade that for reliability and the ability to tackle rougher terrain?\n\nLet's hear your thoughts in the comments below.\n\nImage Sources: Rivian Newsroom, Lucid Newsroom, r/Rivian Even-Machine4824, r/LUCID OrganicNebula\n\nNoah Washingtonis an automotive journalist based in Atlanta, Georgia. He enjoys covering the latest news in the automotive industry and conducting reviews on the latest cars. He has been in the automotive industry since 15 years old and has been featured in prominent automotive news sites. You can reach him onXandLinkedInfor tips and to follow his automotive coverage.\n\nPermalink\n\nMy wife &amp; I drove a 2014 TESLA MODEL S 85 rear wheel drive from vancouver to Halifax Canada in May June 2015.No superchargers from red deer Alberta until Barrie Ontario.  3 hour lunch’s were required to gain 225 kilometers range.Today our 2024 TESLA Model Y, &amp; with the TESLA SUPERCHARGERS, the 225 kilometers additional range is gathered in 20 minutes.  The reason for this post is to enforce the idea that long range travel is only possible with fast RELIABLE charging.  Love Elon or not, but TESLA has the platinum standard for charging stations that just work.  It was never range anxiety but will the charging stations be reliable.  Just buy a vehicle that has a NACS port &amp; you will enjoy your trip.\n\nPermalink\n\nIn reply toMy wife &amp; I drove a 2014…byBruce (not verified)\n\nThanks for sharing your story! I totally agree fast, reliable charging like Teslas makes all the difference for long trips. Reliable fast charging is the real game changer."
  },
  "https://www.wglt.org/tags/rivian": {
    "text": "Become a WGLT sponsor"
  }
}